<?php
return [
    'list' => [
        '«Властелин колец» — Джон Р. Р. Толкин ',
        '«Гордость и предубеждение» — Джейн Остин',
        '«Тёмные начала» — Филип Пулман',
        '«Автостопом по галактике» — Дуглас Адамс',
        '«Гарри Поттер и Кубок огня» — Джоан Роулинг',
        '«Убить пересмешника» — Харпер Ли',
        '«Винни Пух» — Алан Александр Милн',
        '«1984» — Джордж Оруэлл',
        '«Лев, колдунья и платяной шкаф» — Клайв Стэйплз Льюис',
        '«Джейн Эйр» — Шарлотта Бронте',
        '«Уловка-22» — Джозеф Хеллер',
        '«Грозовой перевал» — Эмили Бронте',
        '«Пение птиц» — Себастьян Фолкс',
        '«Ребекка» — Дафна Дюморье',
        '«Над пропастью во ржи» — Джером Сэлинджер',
        '«Ветер в ивах» — Кеннет Грэм',
        '«Большие надежды» — Чарльз Диккенс',
        '«Маленькие женщины» — Луиза Мэй Олкотт',
        '«Мандолина капитана Корелли» — Луи де Берньер',
        '«Война и мир» — Лев Толстой',
        '«Унесённые ветром» — Маргарет Митчелл',
        '«Гарри Поттер и философский камень» — Джоан Роулинг',
        '«Гарри Поттер и Тайная комната» — Джоан Роулинг',
        '«Гарри Поттер и узник Азкабана» — Джоан Роулинг',
        '«Поющие в терновнике» — Колин Маккалоу',
        '«Тэсс из рода д’Эрбервиллей» — Томас Харди',
        '«Миддлмарч» — Джордж Элиот',
        '«Гроздья гнева» — Джон Стейнбек',
        '«Алиса в Стране чудес» — Льюис Кэрролл',
        '«Дневник Трейси Бикер» — Жаклин Уилсон',
        '«Сто лет одиночества» — Габриэль Гарсиа Маркес',
        '«Столпы Земли» — Кен Фоллетт',
        '«Дэвид Копперфильд» — Чарльз Диккенс',
        '«Молитва об Оуэне Мини» — Джон Ирвинг',
        '«Чарли и шоколадная фабрика» — Роальд Даль',
        '«Остров сокровищ» — Роберт Стивенсон',
        '«Город как Элис» — Невил Шют',
        '«Доводы рассудка» — Джейн Остин',
        '«Дюна» — Фрэнк Герберт',
        '«Эмма» — Джейн Остин',
        '«Аня из Зеленых Мезонинов» — Люси Мод Монтгомери',
        '«Обитатели холмов» — Ричард Адамс',
        '«Великий Гэтсби» — Фрэнсис Скотт Фицджеральд',
        '«Возвращение в Брайдсхед» — Ивлин Во',
        '«Граф Монте-Кристо» — Александр Дюма',
        '«Скотный двор» — Джордж Оруэлл',
        '«Рождественская песнь» — Чарльз Диккенс',
        '«Вдали от обезумевшей толпы» — Томас Харди',
        '«Спокойной ночи, мистер Том» — Мишель Магориан',
        '«Семейная реликвия» — Розамунд Пилчер',
        '«Таинственный сад» — Фрэнсис Бернетт',
        '«О мышах и людях» — Джон Стейнбек',
        '«Анна Каренина» — Лев Толстой',
        '«Противостояние» — Стивен Кинг',
        '«Подходящий жених» — Викрам Сет',
        '«БДВ, или Большой и добрый великан» — Роальд Даль',
        '«Ласточки и амазонки» — Артур Рэнсом',
        '«Чёрный красавчик» — Анна Сьюэлл',
        '«Артемис Фаул» — Йон Колфер',
        '«Крестики-нолики» — Мэлори Блэкмен',
        '«Мемуары гейши» — Артур Голден',
        '«Повесть о двух городах» — Чарльз Диккенс',
        '«Мор, ученик Смерти» — Терри Пратчетт',
        '«Преступление и наказание» — Федор Достоевский',
        '«Далекое волшебное дерево» — Энид Блайтон',
        '«Хоббит, или Туда и обратно» — Джон Р. Р. Толкин',
        '«Волхв» — Джон Фаулз',
        '«Благие знамения» — Терри Пратчетт и Нил Гейман',
        '«Стража! Стража!» — Терри Пратчетт',
        '«Повелитель мух» — Уильям Голдинг',
        '«Парфюмер» — Патрик Зюскинд',
        '«Филантропы в рваных штанах» — Роберт Тресселл',
        '«Ночная стража» — Терри Пратчетт',
        '«Матильда» — Роальд Даль',
        '«Дневник Бриджит Джонс» — Хелен Филдинг',
        '«Тайная история» — Донна Тартт',
        '«Женщина в белом» — Уильям Уилки Коллинз',
        '«Улисс» — Джеймс Джойс',
        '«Холодный дом» — Чарльз Диккенс',
        '«Двойняшки» — Жаклин Уилсон',
        '«Семейство Твит» — Роальд Даль',
        '«Я захватываю замок» — Доди Смит',
        '«Ямы» — Луис Сейкер',
        '«Бог мелочей» — Арундати Рой',
        '«Горменгаст» — Мервин Пик',
        '«Вики-Ангел» — Жаклин Уилсон',
        '«О дивный новый мир» — Олдос Хаксли',
        '«Неуютная ферма» — Стелла Гиббонс',
        '«Чародей» — Раймонд Фэйст',
        '«В дороге» — Джек Керуак',
        '«Крестный отец» — Марио Пьюзо',
        '«Клан пещерного медведя» — Джин Ауэл',
        '«Цвет волшебства» — Терри Пратчетт',
        '«Алхимик» — Пауло Коэльо',
        '«Кэтрин» — Аня Сетон',
        '«Каин и Авель» — Джеффри Арчер',
        '«Любовь во время холеры» — Габриэль Гарсиа Маркес',
        '«Девчонки в поисках любви» — Жаклин Уилсон',
        '«Дневники принцессы» — Мэг Кэбот',
        '«Дети полуночи» — Салман Рушди',
    ],
    //Dimensions from http://verstka.jimdo.com/форматы изданий/
    //was used maximal sizes, mm
    'sizes' => [
        [
            'width' => 100,
            'height' => 140
        ],
        [
            'width' => 107,
            'height' => 165
        ],
        [
            'width' => 107,
            'height' => 177
        ],
        [
            'width' => 120,
            'height' => 165
        ],
        [
            'width' => 130,
            'height' => 200
        ],
        [
            'width' => 145,
            'height' => 200
        ],
        [
            'width' => 145,
            'height' => 215
        ],
        [
            'width' => 170,
            'height' => 215
        ],
        [
            'width' => 170,
            'height' => 240
        ],
        [
            'width' => 205,
            'height' => 260
        ],
        [
            'width' => 220,
            'height' => 290
        ],
    ]
];